-- ------------------------------------------------------------------------------
-- 此脚本用于将 Pandas 的主数据库升级到 1.1.8 版本
-- 注意: 若存在更低版本且从未导入的升级脚本, 请按版本号从小到大依序导入
-- ------------------------------------------------------------------------------

-- -----------------------------------------------
-- upgrade_20211008.sql
-- -----------------------------------------------

-- 由于熊猫模拟器给 bonus 增加了唯一编号
-- 因此原先 rAthena 的数据库更新脚本中我们不再 DROP 主键

ALTER TABLE `bonus_script`
    -- DROP PRIMARY KEY,
    ADD KEY `char_id` (`char_id`);
